public class CalcService {  // появляется новый ТИПданных


    public int max(int a, int b) {  /* - чтобы описать ДЕЙСТВИЯ (public);
                                       - ТИП данных, которые она возвращает - у нас максимальное значение (int).
                                          Если бы команда ничего не возвращала (void)
                                       - название КОМАНДЫ, которую сами придумываем (max)
                                       - () и данные на ВХОД, или параметры    */

        int result;        // заводим переменную, в которой будет РЕЗУЛЬТАТ
        if (a > b) {       // описываем ЛОГИКУ приложения
            result = a;
        } else {
            result = b;
        }

        return result;     // ОТДАТЬ данные (тип данных как в действии max)


    }
}
